{"text":" Welcome to ProductionML with HuggingFace. We're going to learn how to build sovereign AI systems with pure rust. The sovereignty I stack allows you to build things without Python. You have full control and you can interact as well with HuggingFace. If you look at HuggingFace here, this is a good place to start. There's millions of models and datasets, the source and then you pull down using APR pull and the model downloads to your stack. has 4 key crates. We have Trenio, which is SIMD and GPU compute. This is the foundation. The accelerated computing layer. We have Apprentire, which is ML algorithms and also the.apr format. We have training and inference. And then Relesar is production inference server. This is APIs and batching. And then we have Batuta, which is in orchestration or a registry integration that automation. If we look at where you can deploy, you can deploy anywhere you can deploy to GPU with CUDA and Metal. You can deploy with SIM. The SIM acceleration doesn't require a GPU and it's surprisingly fast even though it's using a CPU because it goes into the assembly level of the chip. We have Web Assembly, which is a browser runtime with zero infrastructure. You're going to run anywhere and we have Edge, which is arm-based or risk. embedded systems and IoT devices. So same code base, same model for deployment targets. In terms of the core structure here, we have model formats, GGUF, safe tensors, APR. We have, and we do the MLOPS foundation. So CI/CD, observability, security. And then a week three, we get into projects. And we show how you can build things like, DePLYR, a transpiler that converts Python to Rust via single shot deploy. We also have Whisper which allows you to build on top of the transcription library and you can do it in pure rust. We also have Quinn and Quinn works with the APR chat and APR run and APR serve commands. So these are real systems and real deployments. In a nutshell, we have lots of different core components that we're going to study. Let's go on and start with the model formats in week one. [BLANK_AUDIO]","segments":[]}