{"text":" When you download or save a model you're dealing with one of several file formats, we're gonna talk through three important ones. First up we have GGOF from Lama.cpp. Next, save tensed from hugging face and then APR from the Rust sovereign AI stack from Pragmatic labs. Each of these is a little bit different and it's gonna depend on your deployment target. First up here we have GGOF. it comes from LOMASCPP and is optimized for CPU inference. So if we look at consumer hardware, this is going to be a strong fit. We also have the file that starts with the magic bytes or GGUF and we also have metadata that supports many different types as well like integers floats. And then we also have a tensor that stores the name, the number of dimensions, et cetera into the data section. And then in terms of as well. Now if we look at, see, tensors next year, this is the Huggenface answer to the security problems with pickle-based by torch. We also have a simple header, Jason header as well. We have the ability to look at tensor data with no gaps and also row major order. And then the key features here are that as well, you can do memory mapping of the file and access the tensors without having to load it into RAM. And as well, a big thing to point out is that no code execution is possible. So you're not going to be able to embed malicious code. Now a new emerging standard is this operandare portable representation, which is designed for modern SIMD hardware. So what this means is that one of the things you can do with this format is easily package it into a can package it into web assembly. So this is also becoming an interesting use case. So if you wanted to deploy a very small model into a web browser and that web browser used SIMD for acceleration, you don't even need a GPU or you could use WGPU. This is really the strength of the APR format. We also have some advanced features as well. For example, do compression and encryption and tracking. But in general, I guess the main idea here is that you're going to come into contact with safe tensors with GGUF and also with the emerging web assembly and SIMD compatible APR format that works very well if you're natively using Rust. And it's important to understand how to use all of these inside of the Hugging Face ecosystem.","segments":[]}