{"text":" There are three pillars to model observability logs, metrics and traces. Let's first look at logs. We want to log the events. So what happened and when did they happen? Did the model load in terms of debugging? What about the layer output dimensions? A worn could be the attention spike or an error could be that we have a man that was detected. So you want structured logging, you want searchability, and you also want the ability to filter by load. as well in metrics, the numerical measurements over time. So, throughput in terms of tokens per second, latency, percentiles, memory used, time series charts, dashboards, and also alerts when a threshold is breached. And if you look at a bar chart, you could say, look, here we go. There's an anomaly. We need to dig into this and investigate. So this is classic data science, but in terms of have traces here as well, this would be requesting the lifecycle from start to finish. It's really critical when you're dealing with something that is as complex as a model to be able to trace it and look at a waterfall view. I want to look at the tokenization. I want to look at the encoding. I want to look at the decoding, the decolonize. Where does the time code going? Where is the decoder going? All of these things when they fit together show you also have this concept of an anomaly detection pipeline which puts it all together. So you have observability for example looking for nands. We want layer activations before they go to infinity or the model is dying. Latency spikes. So are we getting P99 over a 10x baseline, something is wrong? What about the quality drift as well? If you have a golden data set accuracy and obviously you've of compiler and the loop, you're compiling at 80% of Python to rust, but all of a sudden it drops to 30%. We have a big problem. Let's investigate why the change we made has dropped the accuracy. So in a nutshell, a lot of the traditional observability still plays a role with modern MLops. And even when you're bundling the model into a binary, it plays a critical role as well.","segments":[]}