{"text":" As people use more and more embedded models, put them into binaries, an important component of security is going to be cryptographic verification from the training all the way to the deployment. For example, does the training data itself contain some kind of hidden poison? How would you know, unless you're able to track where that data set came from, where it was used, and then all the way to the model, how it's being used in the model? at how this would work in terms of assigning flow. You could have five steps. Train, sign, publish, download, and verify. So the first thing is generating the weights. Who is training it on what data did it come from? A pirated data source? Was it ethically sourced? Was there any security bugs inside? Who's audited that data? In terms of signing it, we have the checksum. So a cryptographic proof of origin in terms of publishing, we're uploading then the signature within travel with the model in terms of downloading with APR pull so you're fetching the artifacts in terms of verifying you're checking that signature match. Now in terms of the process here a few things to point out would be that private keys would stay secret and you'd hash the model contents and then sign the hash and then you have a public key in the model card so anyone can verify but you are the only person that can sign. This is one of the principles of terms of supply chain threats as well There was the pickle attack. This was the old Pythorge format that isn't something that can be done with these newer model formats We also have the watts the weight swapping so a backdoor model looks normal, but there's a trojan trigger that causes hidden behavior This is an important reason why you want to have cryptographic signatures inside of models in terms of and APR, these are data only formats, so there are no code executions possible, and the signature itself is verified on load. So in a nutshell, as we think more and more about using models with traditional software engineering, these kinds of data governance tasks will become more important.","segments":[]}