{"text":" Byinary deployment is one of the most exciting aspects of local and reduced size models. And the reason it's so exciting is that it opens up lots of different new ways to do automation without having to externally call some SAS provider that is running a GPU in the cloud. Let's take a look at embedded first. So the idea with the embedded is that the model can be bundled inside of the binary. This could be using bytes which compiles the model into the binary. And then once you've got that, the advantages are that you don't have to have a separate model deployed. There's no file I/O at runtime and it also can work in web assembly. So you have an air-gapped environment. This could be very powerful for many different use cases. For example, finding endangered animals in a embedded system that captures it in WebAssembly or doing therapy notes for some kind of session. All these air gap type deployment environments are a good example of why you'd want a binary to be embedded with the model. In terms of external, this is another one you could also have a model that lives on disk and it loads a startup and then you could also hot swap as well. So you're not basically only model inside the binary. If you wanted to toggle between different kinds of models, you could also point to it and have the model live on disk. Another one that's interesting is the memory mapped idea. So the idea is that the OS maps the file directly into virtual memory and then it loads the data on demand. So the pros here are that you have instant load time and you could have the OS itself manage the caching. You could have multiple same data as well. And if you get into X-RIM, you could also start to leverage the kernel itself to put data and also the models in that X-RIM. In terms of a decision matrix, this is where you have to think about it in terms of what you're trying to build. Do you want to build WebAssembly? Do you want to build AirGap or do you want to build hot swap or local development? What are the different things that you're trying to build? but it's important to know once you deal with rust as the language that is going to be used for in my lops, many different new possibilities are aligned with these kinds of techniques because of the fact that it supports it in a very trivial way.","segments":[]}