{"text":" Let's take a look at this modern LLM-OBS project called DePlyer. In this case, it's not just a transpiler that transpiles Python to Rust. It's a self-improving system because it uses an Oracle. Let's take a look at the core transpiler. What does it do? What is the process? First here we have the core pipeline. The idea here is that you can write Python and then you can have Rust out. Good examples of transpilers or things like JavaScript and makes it into a much more robust language like TypeScript. It's similar in this case except for it's a little bit of a different problem and that we have something that is very loosely typed in the case of Python and we go to a very strict and compiled language Rust. In this case we use EST parsing. We also use Hindley Milner type inference and ownership analysis. We also have a standard library library modules including JSON, Hashlib, Collections, DateTime, and we also have the ability to use MCP. What's interesting about using MCP is you can tell an agent or sub agent to transpile Python to analyze the migration complexity. It also to prove the correctness or verify the transpile. There are multiple crates as well. There's annotations, there's the core, there's the analyzer, MCP web assembly and then also the main binary which is DePlier and it's published very frequently and updated. So there's a software engineering component to this but also a hugging phase component to it. In the case of doing a demo, you have a web assembly demo. In this case, what you do in the web assembly demo is run its locally inside a VIRY ecosystem and try make sure that you've got exactly what you care about and you can even customize it for your own environment. And because there's no server around trips, you're running it local. In terms of the corpus, there's an example corpus that's published to a hugging face called Reparested Python CLI. There's almost 300 examples including ArcPars, Async, File, Collections. Also, there are conversions that it this case, we have 606 Python rust pairs and in that example, close to 80% transpile successfully. We also have the concept of tarantula score. So this is another emerging concept which is how suspicious is code in terms of a defect, which Python blocks are something we should look at. And again, this is published to HuggingFace Hub. the case of CITL, the concept is the idea of a compiler in the loop or the compiler itself is such a great signal. We can start to train on it. And that's where the Oracle comes in. And in the case of the Oracle, what it does is it traces inside of what's happening and we can get error classification that's constantly learning about what is successful, what's let's transpile this. Let's run Rust compiler. Let's get the error and then let's have the Oracle Classifier. So this could be a little bit different depending on what kind of environment you're running in and maybe a different company would want to customize this to their own needs. And then we have this concept of what is the model that's being used. In this case, this is a Rust random forest classifier built from scratch. There's 100 trees. There's seven different error categories. to explain why we have these different air category boxes like a tight mismatch or a baro checker or a missing import or a lifetime error. And then finally, it all gets together inside of this concept of compiler and the loop. And the compiler and the loop is the full feedback system, the corpus feeds de-plier, de-plier produces rust, the rust compiler itself produces the diagnostics, the diagnostic, then trains the Oracle, and then the Oracle generates the fixed patterns and it saves it format. And we can of course, upload that model to hugging face as we make it better and better. And we could also fine tune it if you needed to in the future to improve the performance. So the idea here is that we're gonna see these kinds of tools in Rust emerge, especially when you combine it with the traditional software engineering lifecycle like CREATS.O.Dio, but also with the traditional machine learning ecosystem like hugging face. [BLANK_AUDIO]","segments":[]}