{"text":" Let's dive into this Oracle training workflow here. You can see at the very beginning that the idea of training on a corpus gives you a feedback loop that learns projects specific airfix patterns for faster future convergence. So first up here we have the corpus. There's a default corpus on hugging phase. It's also in the repo Python repo rusted CLI, but it also could be Maybe you do specialized visualizations or web development or use community tools, but this is going to be the starting point for the training run. Then you transfer files. You convert Python to Rust code. You then run the compiler. In this case, the Rust C, you capture the error code. So what are the things that are not working correctly? You then do a compile test fix. So you're going through iterating, maybe you have an agent that helps you do this. And then you apply with auto fix you can resolve specific air code. So as the Oracle gets smarter it can learn how to for example do an aster coercion and then you can also record the feedback. So what's nice about this is the user predictor dot learn pattern is called and it can map the air messages and fix the template and then categorize as well. Finally we have an ingram fix predictor in this fix at things like, hey, this pattern fixed pattern tracks with the air pattern, the fixed template, the success rate, and then you would save your user model. In this case, we'll persist to the prior Oracle user bin, and then we'll serialize this via Sere Day Json and it'll survive between sessions. The future convergence will be a red border dash loop and we'll save this model on a startup, so it's going to patterns immediately and you'll have faster convergence on projects specific idioms. You can see the CLI commands here are pretty straightforward, de-player, train, corpus path, optional output, and then the key files are gonna be the ingram.rs, the predictor, the converge, mod or s, this is the wiring, and then you have the persistence. And this project specific learning is gonna be incremental and it's gonna be a fast converge, but also you could share people by putting this model onto hugging face.","segments":[]}