{"text":" This is a small example of the power of using the Deplare system to transpile something from Python to Rust. And what's fun about it is that a lot of the smarts and the intelligence of the transpiler and ultimately the ability to compile via a single shot compile has occurred through compiler and the loop. So traditional machine learning has actually you would build a compiler or a transpiler. And this case we can go ahead and take a look at the Thibonacci. So if I run it and I just type in Python Thibonacci here, you can see that it works. Now, if we want to do the next transpile process, we can take a look at the make file here that will give us some instruction. So first up here, we could land and run tests and all that stuff. But we're going to make things simple. do is transpile this. So first up, Deep Tyler, you can also run help if you wanted to to see all the different kinds of things that could do. But in this case, we're gonna do Deep Tyler Transpile. So let's go ahead and do a transpile of Feminacci. At this point, you can see here that we've got, in fact, execution time measured. We also have the main functions. We have some really cool information inside. We have typed in inference hints. So again, this is all through the power of learning about how to transpile and then ultimately compile down to what we're going to do. So next up what I'm going to do is I'm going to do the compile here. And so in order to do that, I'm going to take that transpile code and see if it actually compiles on the first shot. So let's go ahead and try that. Let's type in RustC. do outfile Fimnachi. In fact, it does compile. And if we run it, there we go. So in this case, we have been able to demonstrate that this is a legitimate technique for many companies wanting to convert from Python to Rust. A lot of the corpus that this has been trained on, a wide variety, let's say 300 so will compile on a single shot, compile correctly. And a lot of this was from using machine learning techniques and training the Oracle so that the software itself became more intelligent. So this is definitely something we're going to see as people embrace using traditional machine learning along with traditional compiler engineering as software engineering best practices. And in this case, we were able to do a single shot conversion. [BLANK_AUDIO]","segments":[]}